package com.hcn.media_theme;

/**
 * etheme 主题定义
 * <pre>
 *   借用 Android 原生的资源命名规则实现；
 *   e.g. {$res_name}-mcc100-mnc01 来区分资源；
 * </pre>
 * @author 86158
 */
public interface ThemeX {
    /** 未配置的主题 **/
    int ET_GOD_NONE = 0;

    /**
     * MT8163 暂未使用
     * <p> 公板纯黑自定义换背景；
     */
    int ET_GOD_110 = 110;

    /**
     * MT8163 暂未使用
     * <p> 配套 sa01 主题包，海外部门定制；
     */
    int ET_GOD_150 = 150;

    /**
     * MT8163 暂未使用
     * <p> 配套 sa02 主题包，海外绿色背景；
     */
    int ET_GOD_151 = 151;

    /**
     * MT8163 在使用（马来西亚）
     * <p> 配套 sa04 主题包，海外红色背景；
     */
    int ET_GOD_152 = 152;

    /**
     * 中道定制
     * <p> 车机海外、国内后装都在使用（有授权）；
     */
    int ET_GOD_153 = 153;

    int ET_GOD_154 = 154;

    /**
     * MT8163 暂未使用
     * <p> 配套 xt51 主题包，守卫龙仿掌讯全套；
     */
    int ET_GOD_201 = 201;

    /**
     * 旋转屏幕使用（支持横竖屏）
     * <p> 多个分辨率都有适配 sw600dp/sw720dp/sw768dp;
     */
    int ET_GOD_202 = 202;

    /**
     * MT8163 暂未使用
     * <p> 配套 xt103 海洋星全套定制；
     */
    int ET_GOD_204 = 204;

    /**
     *  AC8227L 定制
     * <p> 配套 xt109 钢铁侠全套定制；
     */
    int ET_GOD_206 = 206;

    /**
     * 恒晨品牌整机定制;
     * <p> 配套 hcn08 主题使用；
     */
    int ET_GOD_207 = 207;

    /**
     *  AC8227L 定制
     * <p> 从多媒体旧工程移植过来
     */
    int ET_GOD_209 = 209;

    /**
     * MT8163 暂未使用
     * <p> 头枕屏定制
     */
    int ET_GOD_300 = 300;

    /**
     * MT8321 默认皮肤
     * <p> 横屏使用，竖屏没有刻意去适配过；
     */
    int ET_GOD_321 = 321;

    /**
     * MT8163 平台默认主题
     * <p> 默认出货的物理横屏设备；
     */
    int ET_GOD_400 = 400;

    /**
     * MT8163 未使用
     * <p> AC8257 最开始设计的
     */
    int ET_GOD_401 = 401;

    /**
     * MT8257/MT8163 竖屏蓝色背景
     * <p> 只适配了竖屏，海外土耳其 Mese 客户定制；
     */
    int ET_GOD_402 = 402;

    /**
     * MT8163 未使用
     * <p> 8257-MD06 美灿欣定制
     */
    int ET_GOD_403 = 403;

    /**
     * 中道-安桥、土耳其客户使用；
     * <p> 横屏使用，竖屏没有刻意去适配过；
     */
    int ET_GOD_405 = 405;

    /**
     * AC8257 定制
     * <p> 海外中道-安桥、土耳其客户使用；
     */
    int ET_GOD_405_001 = 405 * 1000 + 1;

    /**
     * MT8163 定制
     * <p> 车机海外 SANSUI 客户定制；
     */
    int ET_GOD_400_011 = 400 * 1000 + 11;

    /**
     * MT8163 定制
     * <p> 凯越客户定制（如果后续定制变多，建议移出去）
     */
    int ET_GOD_400_014 = 400 * 1000 + 14;

    /**
     * AC8227L 定制
     * <p> 从多媒体旧工程移植过来
     */
    int ET_GOD_400_015 = 400 * 1000 + 15;

    /**
     * MT8163 定制
     * <p> 军灿客户定制（skinx-blue01）
     */
    int ET_GOD_400_016 = 400 * 1000 + 16;

    /**
     * AC8227L 定制
     * <p> 从多媒体旧工程移植过来
     */
    int ET_GOD_400_017 = 400 * 1000 + 17;

    /**
     * MT8163 定制
     * <p> 飞音客户定制（skinx-blue01）
     */
    int ET_GOD_400_022 = 400 * 1000 + 22;

    /**
     * UIS8581 定制
     * <p> 平台默认皮肤是 mcc400-mnc100
     */
    int ET_GOD_400_100 = 400 * 1000 + 100;

    /**
     * UIS8581 定制
     * <p> 平台定制皮肤 mcc400-mnc103（za03）
     */
    int ET_GOD_400_103 = 400 * 1000 + 103;

    /**
     * UIS8581 定制
     * <p> 平台定制皮肤 mcc400-mnc104（za04）
     */
    int ET_GOD_400_104 = 400 * 1000 + 104;

    /**
     * UIS8581 定制
     * <p> 平台定制皮肤 mcc400-mnc105（za05）
     */
    int ET_GOD_400_105 = 400 * 1000 + 105;

    /**
     * UIS8581 定制
     * <p> 飞音客户定制 mcc600
     */
    int ET_GOD_600 = 600;

    /**
     * UIS8581 定制
     * <p> 平台定制皮肤 mcc400_mnc109
     */
    int ET_GOD_400_109 = 400 * 1000 + 109;

    /**
     * UIS8581 定制
     * <p> 平台定制皮肤 mcc400_mnc110
     */
    int ET_GOD_400_110 = 400 * 1000 + 110;
    int ET_GOD_400_139 = 400 * 1000 + 139;

    /**
     * AC8227L 定制（雷克萨斯头枕）
     * <p> 从多媒体旧工程移植过来（海外头枕项目，分辨率：1920x1080）
     */
    int ET_GOD_406 = 406 * 1000;

    /**
     * AC8257 平台前装 N91 主题
     */
    int ET_GOD_501 = 501;
}
